Curso_CFD_OS/cavity_pr2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.1;

vertices
(
    (0     0   0)
    (1     0   0)
    (1   -0.2  0)
    (2.2 -0.2  0)
    (2.2  0    0)
    (2.2  1    0)
    (1    1    0)
    (0    1    0)

    (0     0   1)
    (1     0   1)
    (1   -0.2  1)
    (2.2 -0.2  1)
    (2.2  0    1)
    (2.2  1    1)
    (1    1    1)
    (0    1    1)



 );

blocks
(
    hex (0 1 6 7 8  9 14 15) (10 10 1) simpleGrading (1 1 1)
    hex (2 3 4 1 10 11 12 9) (12 2  1) simpleGrading (1 1 1)
    hex (1 4 5 6 9 12 13 14) (12 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    lid
    {
        type wall;
        faces
        (
            (5 13 14 6)
            (6 14 15 7)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 8 15 7)
            (1 9  8 0)
            (2 10 9 1)
            (3 11 10 2)
            (4 12 11 3)
            (5 13 12 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 7 6 1)
            (1 4 3 2)
            (1 6 5 4)
            (8 9 14 15)
            (9 10 11 12)
            (9 12 13 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
