Curso_CFD_OS/cavity_pr2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    lid
    {
        type            wall;
        inGroups        1(wall);
        nFaces          22;
        startFace       454;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          46;
        startFace       476;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          488;
        startFace       522;
    }
)

// ************************************************************************* //
